<a href="https://colab.research.google.com/github/Codinggenttleman/202010/blob/main/Chapter_7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None

string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [8]:
cleaned = data.dropna()

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how= 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4] = NA

data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis =1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df = pd.DataFrame(np.random.randn(7,3))

df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0  0.472085       NaN       NaN
1 -1.316828       NaN       NaN
2 -0.581251       NaN -0.627598
3 -0.121095       NaN  0.364767
4  0.260948  0.597730 -1.093065
5  1.081994  0.636375 -0.808178
6 -0.310149 -0.794440  0.977036

In [14]:
df.dropna()

          0         1         2
4  0.260948  0.597730 -1.093065
5  1.081994  0.636375 -0.808178
6 -0.310149 -0.794440  0.977036

In [15]:
df.dropna(thresh=2)

          0         1         2
2 -0.581251       NaN -0.627598
3 -0.121095       NaN  0.364767
4  0.260948  0.597730 -1.093065
5  1.081994  0.636375 -0.808178
6 -0.310149 -0.794440  0.977036

In [16]:
df.fillna(0)

          0         1         2
0  0.472085  0.000000  0.000000
1 -1.316828  0.000000  0.000000
2 -0.581251  0.000000 -0.627598
3 -0.121095  0.000000  0.364767
4  0.260948  0.597730 -1.093065
5  1.081994  0.636375 -0.808178
6 -0.310149 -0.794440  0.977036

In [17]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.472085  0.500000  0.000000
1 -1.316828  0.500000  0.000000
2 -0.581251  0.500000 -0.627598
3 -0.121095  0.500000  0.364767
4  0.260948  0.597730 -1.093065
5  1.081994  0.636375 -0.808178
6 -0.310149 -0.794440  0.977036

In [19]:
_ = df.fillna(0, inplace = True)
df

          0         1         2
0  0.472085  0.000000  0.000000
1 -1.316828  0.000000  0.000000
2 -0.581251  0.000000 -0.627598
3 -0.121095  0.000000  0.364767
4  0.260948  0.597730 -1.093065
5  1.081994  0.636375 -0.808178
6 -0.310149 -0.794440  0.977036

In [20]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] =NA
df.iloc[4:,2] =NA
df

          0         1         2
0  0.381464 -0.236307  0.377154
1 -0.215135  0.734798  1.122960
2 -1.365123       NaN  0.695282
3 -1.079577       NaN  1.402447
4  0.535824       NaN       NaN
5  1.811734       NaN       NaN

In [21]:
df.fillna(method='ffill')

          0         1         2
0  0.381464 -0.236307  0.377154
1 -0.215135  0.734798  1.122960
2 -1.365123  0.734798  0.695282
3 -1.079577  0.734798  1.402447
4  0.535824  0.734798  1.402447
5  1.811734  0.734798  1.402447

In [23]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.381464 -0.236307  0.377154
1 -0.215135  0.734798  1.122960
2 -1.365123  0.734798  0.695282
3 -1.079577  0.734798  1.402447
4  0.535824       NaN  1.402447
5  1.811734       NaN  1.402447

In [24]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [26]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 5]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   5

In [27]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [28]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   5

In [29]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [31]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   5   6

In [32]:
data= pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Vacon',
                              'pastrami', 'honey ham', 'nova lox'],
                    'ounces' : [4,3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Vacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [44]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [45]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [46]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [48]:
data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                     'ounces' : [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow', 
    'corned beef' : 'cow',
    'honey ham' : 'pig', 
    'nova lox' : 'salmon'
}

In [50]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [51]:
data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [54]:
data = pd.Series([1. , -999., 2., -999, -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [57]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [58]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data.replace([{-999: np.nan, -1000: 0}])

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [60]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index = ['Ohio', 'Colorado', 'New York'],
                    columns = ['one', 'two', 'three', 'four'])

In [62]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [65]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [67]:
data.rename(index={'OHIO': 'INDIANA'},
            columns ={'three' : 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [68]:
data.rename(index={'OHIO' : 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [70]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [71]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [72]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [73]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

Note that pd.value_counts(cats) are the bin counts for the result of pandas.cut.
Consistent with mathematical notation for intervals, a parenthesis means that the side is open, while the square bracket means it is closed (inclusive). You can change which side is closed by passing right=False:

In [74]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [75]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [76]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.71, 0.93], (0.71, 0.93], (0.71, 0.93], (0.49, 0.71], (0.05, 0.27], ..., (0.49, 0.71], (0.05, 0.27], (0.71, 0.93], (0.05, 0.27], (0.05, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.05, 0.27] < (0.27, 0.49] < (0.49, 0.71] < (0.71, 0.93]]

In [77]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.664, 3.695], (-2.834, -0.695], (-2.834, -0.695], (0.664, 3.695], (-0.0113, 0.664], ..., (0.664, 3.695], (-0.695, -0.0113], (0.664, 3.695], (0.664, 3.695], (-0.0113, 0.664]]
Length: 1000
Categories (4, interval[float64]): [(-2.834, -0.695] < (-0.695, -0.0113] < (-0.0113, 0.664] <
                                    (0.664, 3.695]]

In [78]:
pd.value_counts(cats)

(0.664, 3.695]       250
(-0.0113, 0.664]     250
(-0.695, -0.0113]    250
(-2.834, -0.695]     250
dtype: int64

In [79]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.264, 3.695], (-1.323, -0.0113], (-1.323, -0.0113], (-0.0113, 1.264], (-0.0113, 1.264], ..., (-0.0113, 1.264], (-1.323, -0.0113], (-0.0113, 1.264], (1.264, 3.695], (-0.0113, 1.264]]
Length: 1000
Categories (4, interval[float64]): [(-2.834, -1.323] < (-1.323, -0.0113] < (-0.0113, 1.264] <
                                    (1.264, 3.695]]

In [80]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(1.264, 3.695], (-1.323, -0.0113], (-1.323, -0.0113], (-0.0113, 1.264], (-0.0113, 1.264], ..., (-0.0113, 1.264], (-1.323, -0.0113], (-0.0113, 1.264], (1.264, 3.695], (-0.0113, 1.264]]
Length: 1000
Categories (4, interval[float64]): [(-2.834, -1.323] < (-1.323, -0.0113] < (-0.0113, 1.264] <
                                    (1.264, 3.695]]

In [81]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004343     0.027256     0.007524    -0.012495
std       0.973965     0.996387     0.983942     0.975704
min      -3.001491    -3.462141    -3.278380    -3.321637
25%      -0.632962    -0.642999    -0.660833    -0.653864
50%      -0.005348     0.003799    -0.020275    -0.044174
75%       0.647730     0.703928     0.688230     0.596742
max       2.770266     3.263438     3.224404     3.370031

In [82]:
col = data[2]
col[np.abs(col) >3]

645   -3.278380
766    3.224404
896    3.061400
Name: 2, dtype: float64

In [83]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
160  0.681220  2.077147  0.643594 -3.321637
220  0.025835 -0.203531 -2.860104  3.370031
415  0.151600  3.263438  0.950771  0.122697
464 -3.001491 -0.278996 -1.408795  0.070272
645 -1.257484 -1.311949 -3.278380 -0.140395
766  0.358225  0.281162  3.224404  0.166101
896  1.103736  0.484853  3.061400 -0.216462
917 -0.293433 -3.462141 -1.161678 -1.299271

In [85]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004345     0.027455     0.007517    -0.012543
std       0.973960     0.994050     0.982151     0.973449
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.632962    -0.642999    -0.660833    -0.653864
50%      -0.005348     0.003799    -0.020275    -0.044174
75%       0.647730     0.703928     0.688230     0.596742
max       2.770266     3.000000     3.000000     3.000000

In [86]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0  1.0 -1.0  1.0
2 -1.0 -1.0  1.0  1.0
3 -1.0 -1.0 -1.0 -1.0
4 -1.0  1.0  1.0 -1.0

In [88]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([2, 0, 3, 1, 4])

In [89]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [90]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19

In [91]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [93]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace = True)
draws

1    7
4    4
3    6
0    5
1    7
3    6
0    5
2   -1
2   -1
2   -1
dtype: int64

In [94]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1' : range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [95]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [98]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

/usr/local/lib/python3.6/dist-packages/pandas/io/parsers.py:755: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  return read_csv(**locals())

FileNotFoundError: ignored

In [99]:
val = 'a,b, guido'

val.split(',')

['a', 'b', ' guido']

In [100]:
pieces= [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [102]:
first, second, third = pieces
first + '::' + second + "::" + third

'a::b::guido'

In [103]:
'::'.join(pieces)

'a::b::guido'

In [104]:
'guido' in val

True

In [105]:
val.index(',')

1

In [106]:
val.find(':')

-1

In [108]:
val.index(':')

ValueError: ignored

Note the difference between find and index is that index raises an exception if the string isnt found (versus returning 1):

In [109]:
val.count(',')

2

In [110]:
val.replace(',', '::')

'a::b:: guido'

In [111]:
val.replace(',' , '')

'ab guido'

In [113]:
import re

text = "foo     bar\t baz   \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [114]:
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [115]:
regex.findall(text)

['     ', '\t ', '   \t']

In [117]:
text = """Dave dave@google.com
steve steve@gmail.com
Rob rob@gamil.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags = re.IGNORECASE)

regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gamil.com', 'ryan@yahoo.com']

In [139]:
m = regex.search(text)
m

In [140]:
text[m.start():m.end()]

'dave@google.com'

In [141]:
print(regex.match(text))

None

In [142]:
print(regex.sub('READACTED', text))

Dave READACTED
steve READACTED
Rob READACTED
Ryan READACTED

In [143]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [144]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gamil', 'com'),
 ('ryan', 'yahoo', 'com')]

In [145]:
print(regex.sub(r'Username:\1, Domain: \2, Suffix: \3', text))

Dave Username:dave, Domain: google, Suffix: com
steve Username:steve, Domain: gmail, Suffix: com
Rob Username:rob, Domain: gamil, Suffix: com
Ryan Username:ryan, Domain: yahoo, Suffix: com

In [146]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [147]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [148]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [149]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [150]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [155]:
import re

matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [157]:
matches.str.get(1)

AttributeError: ignored

In [161]:
matches.str[0]

AttributeError: ignored

In [138]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [160]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object